Autodesk.Revit.DB.ImportColorMode
Since:
2013
An enumerated type listing how colors are handled in an import process.
Since:
2013

Autodesk.Revit.DB.ImportColorMode.BlackAndWhite
Colors in the imported drawing are converted to Black and White.

Autodesk.Revit.DB.ImportColorMode.Inverted
Colors in the imported drawing are inverted.

Autodesk.Revit.DB.ImportColorMode.Preserved
Colors in the imported drawing are preserved.